Repository: bleachbit/bleachbit
Catalog: po/*.po
Languages: ro

source: _Shred Files
ro: _Suprascrie fisierele

source: Delete the list of game servers
ro: Stergeti lista de game servere

source: Game
ro: Joc

source: Clean database fragmentation to reduce space and improve speed without removing any data
ro: Reduce fragmentarea bazei de date pentru a micsora spatiul ocupat si a mari viteza, fara a sterge date

source: Delete the cache
ro: Stergeti memoria cache

source: Cookies
ro: Cookie-uri

source: Current session
ro: Sesiune curenta

source: Delete the current session
ro: Stergeti sesiunea curenta

source: Delete the history, which includes bookmarks, downloads, and visited sites
ro: Stergeti istoricul - care include semnele de carte, descarcarile si site-urile vizitate

source: Delete the web cache, which reduces time to display revisited pages
ro: Stergeti memoria cache - care reduce timpul in care sunt afisate paginile revizitate

source: History
ro: Istoric

source: Web browser
ro: Navigator web

source: Delete the usage history
ro: Stergeti istoricul de utilizari

source: Delete ~/.viminfo which includes file history, command history, and buffers
ro: Sterge ~/.viminfo ce include

source: Delete the logs
ro: Stergeti jurnalele de inregistrari

source: Logs
ro: Jurnale

source: Multimedia viewer
ro: Vizualizare multimedia

source: Debug logs
ro: Jurnale de depanare

source: Delete the debug logs
ro: Stergeti jurnalele de depanare

source: Delete the list of recently used documents
ro: Stergeti lista cu ultimele documente utilizate

source: Most recently used
ro: Cele mai recente utilizari

source: Delete the temporary files
ro: Stergeti fisierele temporare

source: Temporary files
ro: Fișiere temporare

source: Chat client
ro: Client chat

source: Chat logs
ro: Jurnale de chat

source: Delete the chat logs
ro: Stergeti jurnalele de chat

source: Delete the list of visited web pages
ro: Stergeti lista paginilor web vizitate

source: Delete the search indexes
ro: Stergeti indexul cautarilor

source: Search indexes
ro: Index cautare

source: Search tool
ro: Unealta de cautare

source: File transfer client
ro: Client pentru transfer de fisiere

source: Download history
ro: Istoricul descarcarilor

source: List of files downloaded
ro: Lista fisierelor descarcate

source: List of visited web pages
ro: Lista paginilor web vizitate

source: URL history
ro: Istoric URL-uri

source: A database of URLs including bookmarks, favicons, and a history of visited web sites
ro: O baza de date cu URL-uri - ce pot include semne de carte, icon-uri favorite si site-urile vizitate

source: A database of usernames and passwords as well as a list of sites that should not store passwords
ro: O baza de date cu nume de utilizator si parole, de asemenea o lista cu site-uri ce nu ar trebui sa stocheze parole

source: Passwords
ro: Parole

source: Places
ro: Locații

source: Delete obsolete files
ro: Sterge fisierele care nu mai sunt necesare

source: Delete the search history
ro: Stergeti istoricul cautarilor

source: Search history
ro: Istoricul căutărilor

source: Backup files
ro: Fişiere copie de siguranţă (backup)

source: Delete the backup files
ro: Stergeti fisierele copiilor se siguranta (backup)

source: Delete downloaded podcasts
ro: Sterge podcast-urile descarcate

source: Downloaded podcasts
ro: Podcast-uri descarcate

source: Delete the current and last sessions
ro: Stergeti sesiunea curenta si cea precedenta

source: Session
ro: Sesiune

source: Thumbnails
ro: Miniaturi

source: Delete the command history
ro: Stergeti istoricul comenzilor

source: Recent documents list
ro: Lista cu documente recente

source: Delete the cookies, visited URLs, and search history
ro: Stergeti cookie-uri, URL-uri vizitate, si istoricul de cautare

source: Delete the search index, a database of words and the files they contain
ro: Stergeti indexul de cautare - o baza de date a cuvintelor cautate si a fisierelor ce le contin

source: Unnecessary file cleaner
ro: Stergerea fisierelor care nu mai sunt necesare

source: Free space and maintain privacy
ro: Spatiu liber si pastrarea intimitatii

source: Form history
ro: Istoric formelor completate

source: A history of forms entered in web sites and in the Search bar
ro: Istoricul formelor completate pe wesite-uri sau pe bara de cautare

source: Session restore
ro: Restaurare sesiune

source: Loads the initial session after the browser closes or crashes
ro: Incarca sesiunea initiala dupa ce navigatorul web s-a inchis

source: Office suite
ro: Suita office

source: Delete the files in the rpmbuild build directory
ro: Sterge fisierele din directorul rpmbuild

source: Broken desktop files
ro: Fisiere desktop nefunctionale

source: Delete broken application menu entries and file associations
ro: Sterge intrarile din meniu si asocierile pentru aplicatiile nefunctionale

source: Localizations
ro: Localizari

source: Delete files for unwanted languages
ro: Stergeti fisierele pentru limbile nedorite

source: Rotated logs
ro: Jurnale vechi

source: Delete old system logs
ro: Sterge fisierele jurnal invechite

source: Trash
ro: Gunoi

source: Empty the trash
ro: Goleste containerul cu fisiere sterse

source: Recycle bin
ro: Container fisiere sterse

source: Empty the recycle bin
ro: Goleste cosul de gunoi

source: The desktop environment's clipboard used for copy and paste operations
ro: Clipboard folosit pentru operatii de copy, paste

source: The system in general
ro: Sistem in general

source: System
ro: Sistem

source: Recycle bin %s
ro: Cos de gunoi %s

source: output version information and exit
ro: afișează informații despre versiune și termină

source: Delete
ro: Sterge

source: Truncate
ro: Trunchiază

source: Cannot import Python module sqlite3: Python 2.5 or later is required.
ro: Nu pot importa modulul sqlite3 pentru Python: Este necesara versiunea Python 2.5.

source: Preferences
ro: Preferinte

source: Drives
ro: Unități

source: Languages
ro: Limbi

source: Check periodically for software updates via the Internet
ro: Verifica periodic, via Internet, aparitia unor noi versiuni

source: If an update is found, you will be given the option to view information about it. Then, you may manually download and install the update.
ro: Daca este gasita o versiune noua, veti avea optiunea sa vedeti mai multe informatii despre aceasta. Dupa care, manual, puteti descarca si instala noua versiune.

source: Hide irrelevant cleaners
ro: Ascunde curatatoarele irelevante

source: Overwrite files to hide contents
ro: Suprescriere fisiere pentru a preveni recuperarea continutului

source: Overwriting is ineffective on some file systems and with certain BleachBit operations. Overwriting is significantly slower.
ro: Suprascrierea este ineficienta pe anumite sisteme de fisiere impreuna cu anumite operatii BleachBit. Suprascrierea este mult mai inceata.

source: Choose a folder
ro: Alegeți un dosar

source: Add
ro: Adaugă

source: Remove
ro: Șterge

source: All languages will be deleted except those checked.
ro: Toate limbile vor fi sterse cu exceptia celor selectate.

source: Preserve
ro: Păstrează

source: Code
ro: Cod

source: Name
ro: Nume

source: Delete confirmation
ro: Confirmare de stergere

source: Are you sure you want to permanently delete files according to the selected operations? The actual files that will be deleted may have changed since you ran the preview.
ro: Esti sigur ca vrei sa stergi definitiv fisierele conform operatiilor selectate ? Este posibil ca fisierele ce vor fi sterse sa se fi schimbat de la ultima vizualizare.

source: Are you sure you want to permanently delete these files?
ro: Esti sigur ca vrei stergi definitiv aceste fisiere ?

source: Active
ro: Activ

source: You must select an operation
ro: Trebuie sa alegeti o operatie

source: Done.
ro: Gata.

source: Program to clean unnecessary files
ro: Program de eliminare a fisierelor care nu mai sunt necesare

source: GNU General Public License version 3 or later. See http://www.gnu.org/licenses/gpl-3.0.txt
ro: Licenta GNU General Public Licence versiunea 3 sau mai noua Vezi http://www.gnu.org/licenses/gpl-3.0.txt

source: translator-credits
ro: Launchpad Contributions: Catalin Fluturel https://launchpad.net/~fkt Lucian Adrian Grijincu https://launchpad.net/~lucian.grijincu

source: Choose files to shred
ro: Alegeti fisierele de distrus

source: _Quit
ro: _Iesire

source: _File
ro: _Fisier

source: _Edit
ro: _Editare

source: Help Contents
ro: Index documentaţie

source: _Release Notes
ro: _Notele versiunii

source: _About
ro: _Despre

source: _Help
ro: _Ajutor

source: Preview
ro: Previzualizare

source: Preview files in the selected operations (without deleting any files)
ro: Vizualizeaza fisierele pentru operatiunile selectate ( fara a sterge vreun fisier)

source: Delete files in the selected operations
ro: Sterge fisierele

source: Update BleachBit
ro: Incarca o noua versiune BleachBit

source: BleachBit update is available
ro: O noua versiune BleachBit este disponibila

source: Click 'Update BleachBit' for more information
ro: Click 'Update BleachBit' pentru mai multe informatii

source: The following cleaner definition file has changed. Malicious definitions can damage your computer.
ro: Urmatorul fisier de configurare a curatatorului s-a schimbat. O configurare defectuoasa poata dauna calculatorului.

source: The following cleaner definition file is new. Malicious definitions can damage your computer.
ro: Urmatorul fisier de configurare a curatatorului este nou. O configurare defectuoasa poata dauna calculatorului.

source: Executable not found: %s
ro: Fisier exeeutabil negasit: %s

source: %s cannot be cleaned because it is currently running. Close it, and try again.
ro: %s nu poate fi curatat pentru ca ruleaza. Inchideti-l si apoi incercati din nou.

source: Error when checking for updates:
ro: A aparut o eroare in timp ce cautam versiuni noi:

source: Exception while running operation '%(operation)s': '%(msg)s'
ro: A aparut o exceptie in timp ce curatam %(operation)s: %(msg)s

source: Please wait. Cleaning %s.
ro: Va rog asteptati. Curat %s.

source: Please wait. Previewing %s.
ro: VA rog asteptati. Vizualizare %s.

source: Special operations: %d
ro: Operații speciale: %d

source: Errors: %d
ro: Erori: %d
